In [2]:
import pandas as pd
import csv
import datetime as dt
import pymongo
from sqlalchemy import create_engine
from config import username, password

# Extraction

In [4]:
# Extracted two data sources:
world = pd.read_csv('2019_nC0v_20200121_20200126_cleaned.csv')
us = pd.read_csv('us-counties.csv')
tax_data = pd.read_csv('2014_irs_tax_returns.csv')

# Transform

### First Dataset

In [5]:
tax_data.head()

,statefips,state,zipcode,agi_stub,n1,mars1,mars2,mars4,prep,n2,...,a10300,n85530,a85530,n85300,a85300,n11901,a11901,n11902,a11902,year
0,1,AL,0,1,850050,481840,115070,240450,479900,1401930,...,324575,0,0,0,0,62690,47433,744910,1964826,2014
1,1,AL,0,2,491370,200750,150290,125560,281350,1016010,...,950446,0,0,0,0,70780,101969,413790,1177400,2014
2,1,AL,0,3,259540,75820,142970,34070,156720,589190,...,1319641,0,0,0,0,62170,132373,192050,538160,2014
3,1,AL,0,4,164840,26730,125410,10390,99750,423300,...,1394913,0,0,0,0,45120,124048,115470,375882,2014
4,1,AL,0,5,203650,18990,177070,5860,122670,565930,...,3655700,610,135,270,66,81180,387298,114380,448442,2014

In [51]:
taxes = tax_data.drop(columns=['n1','mars1','mars2','mars4','prep','n2','a10300','n85530','a85530']).dropna()

In [56]:
tax = taxes.drop(columns = ['numdep','total_vita','vita','tce','n06500','a06500','n10300','n85300','a85300','n00200','a00200','n00300','a00300',
                           'n00600','a00600','n00650','a00650','n00700','a11070','n10960','n11560','a00700','n00900','a00900','n01000','n59720',
                           'a59720','n11070','a10960','a11560','n11901','a11901','n01400','a01400','n01700','a85775','n09750','a09750','n10600',
                           'a01700','schf','n02300','a02300','n02500','a09400','n85770','n85775','a10600','n59660','a59660','n11902','a11902',
                           'a02500','n26270','a26270','a07230','n07240','a07240','n07220','a07220','n07260','a07260','n09400','a85770','n02900',
                           'a02900','n03220','n05780','a05780','a05780','n07100','a07100','n07300','a07300','n07180','n07230','a03220','n03300',
                           'n19700','a19700','n04800','a04800','n05800','n09600','a09600','a07180','a03300','n03270','a03270','n18450','a18450',
                           'n18500','a18500','n18300','a18300','n19300','a19300','a05800','n03150','a03150','n03210','n03230','a03230','n03240',
                           'a03240','n04470','a04470','a00101','n18425','a18425','a03210','a01000','n02650'])

In [57]:
tax.head()

   statefips state  zipcode  agi_stub    a00100    a02650  year
0          1    AL        0         1  11004990  11187657  2014
1          1    AL        0         2  17658446  17836190  2014
2          1    AL        0         3  15963943  16117661  2014
3          1    AL        0         4  14294375  14422811  2014
4          1    AL        0         5  27387096  27664725  2014

In [9]:
def dateFun2(str):
    return dt.datetime.strptime(str,'%m/%d/%Y')

### Second Dataset

In [11]:
us.state.count()

56541

In [12]:
us.head()

         date     county       state     fips  cases  deaths
0  2020-01-21  Snohomish  Washington  53061.0      1       0
1  2020-01-22  Snohomish  Washington  53061.0      1       0
2  2020-01-23  Snohomish  Washington  53061.0      1       0
3  2020-01-24       Cook    Illinois  17031.0      1       0
4  2020-01-24  Snohomish  Washington  53061.0      1       0

### Object to Date Function

In [13]:
def dateFun(str):
    return dt.datetime.strptime(str, '%Y-%m-%d')

In [14]:
us['date'] = us['date'].map(dateFun)

In [15]:
us.set_index('date').sort_index()

                county       state     fips  cases  deaths
date
2020-01-21   Snohomish  Washington  53061.0      1       0
2020-01-22   Snohomish  Washington  53061.0      1       0
2020-01-23   Snohomish  Washington  53061.0      1       0
2020-01-24        Cook    Illinois  17031.0      1       0
2020-01-24   Snohomish  Washington  53061.0      1       0
...                ...         ...      ...    ...     ...
2020-04-13    Sublette     Wyoming  56035.0      1       0
2020-04-13  Sweetwater     Wyoming  56037.0      9       0
2020-04-13       Teton     Wyoming  56039.0     56       0
2020-04-13       Uinta     Wyoming  56041.0      4       0
2020-04-13    Washakie     Wyoming  56043.0      4       0

[56541 rows x 5 columns]

In [16]:
us['date'].max()

Timestamp('2020-04-13 00:00:00')

# LOADING

### Mongo Database

In [17]:
conn = 'mongodb://localhost:27017'

In [18]:
client = pymongo.MongoClient(conn)

In [19]:
db = client.etl_db
table = db.etl

In [20]:
world3.head()

  Province/State         Country Date last updated  Confirmed  Deaths
0       Shanghai  Mainland China         1/21/2020        9.0     0.0
1         Yunnan  Mainland China         1/21/2020        1.0     0.0
2        Beijing  Mainland China         1/21/2020       10.0     0.0
3         Taiwan          Taiwan         1/21/2020        1.0     0.0
4          Jilin  Mainland China         1/21/2020        0.0     0.0

In [21]:
world3.set_index('Date last updated', inplace = True)

In [22]:
table.insert_one(world3.to_dict())

### PostGresSQL Database

In [9]:
db = create_engine(f'postgresql://{username}:{password}@localhost:5432/etl_db')

In [10]:
db.table_names()

['etl']

In [11]:
world3.to_sql('etl', con=db)

ValueError: Table 'etl' already exists.